
        <center><h1>Клас головного вікна QMainWindow</h1></center>
        <br>
        <p>QMainWindow - це дуже важливий клас, який реалізує головне вікно, що містить в собі типові віджети, необхідні більшості додатків, такі як меню, секції для панелей інструментів, робочу область, рядка стану. В цьому класі зовнішній вигляд вже підготовлений і його віджети не потребують додаткового розміщення, так як вони вже знаходяться в потрібних місцях.</p>
        <p>Вікно додатка, зображене на малюнку, має рамку, область заголовка для відображення імені і три кнопки, що керують вікном. Крім цього, вікно програми має меню, яке розташовується нижче області заголовка вікна. Панель інструментів розташована під меню. Під робочою областю розташований рядок стану.</p>
        <p>Покажчик на віджет меню можна отримати викликом методу QMainWindow :: menuBar () і встановити в ньому потрібні спливаючі меню:</p>
        <pre><code class="cpp">QMenu* pmnuFile = new QMenu("&File") ;   

       pmnuFile->addAction("&Save");   

       menuBar()->addMenu(pmnuFile);  </code></pre>
        <br><img src="images/mainwindow.png"><br>
        <p>Як правило, встановлюються такі спливаючі меню:</p>
        <p> File (Файл) - містить основні операції для роботи з файлами: New (Створити) Open (Відкрити), Save (Зберегти), Print (Друк) і Quit (Вихід);</p>
        <p> Edit (Правка) - містить команди загального редагування: Cut (Вирізати), Сміттю (Копіювати), Paste (Вставити); Undo (Скасувати), Redo (Повторити), Find (Знайти), Replace (Замінити) і Delete (Очистити);</p>
        <p> View (Вид) - містить команди, що змінюють уявлення даних вікна. Наприклад, команда Zoom (Масштаб) масштабує відображення документа. У цей меню можна включати і ті команди, які керують відображенням елементів інтерфейсу програми, наприклад: панелі інструментів і рядка стану;</p>
        <p> Help (Довідка) - необхідна для надання допомоги користувачеві, при освоєнні програми. А також, звичайно, включає в себе інформацію про авторські права додатки. Наприклад, при виборі команди About (Про програму) з'явиться вікно, що відображає назва програми, його версію, інформацію про авторські права.</p>
        <p>Щоб отримати покажчик на робочу область, слід викликати метод QMainWindow :: centralWidget (), який поверне покажчик на QWidget. Для установки віджета робочої області буде потрібно викликати метод QMainWindows :: setCentralWidget () і передати в нього покажчик на цей віджет.</p>
        <p>Метод QMainWindow :: statusBar () повертає покажчик на віджет рядки стану. Кнопка зміни розмірів вікна, розташована в нижньому правому куті рядка стану, є всього лише підказкою для користувача, що повідомляє про те, що розміри головного вікна можуть бути змінені. Цей віджет реалізований в класі QSizeGrip. Отримати покажчик на нього з класу головного вікна (QMainWindow) неможливо, так як він знаходиться під контролем віджета рядки стану.</p>
        <script type="text/javascript">hljs.initHighlightingOnLoad();</script>
       