
        <center><h1>Створення меню в Qt</h1></center>
        <br>
        <p>Меню є важливою і невід'ємною частиною практично будь-якої програми. Воно знаходиться у верхній частині головного вікна програми і являє собою секцію для розташування великої кількості команд, з яких користувач може вибирати потрібну. У додатках використовуються меню чотирьох основних типів:</p>
        <p> - меню верхнього рівня;</p>
        <p> - спливаюче меню;</p>
        <p> - відривний меню, яке можна відокремлювати</p>
        <p> - від основного;</p>
        <p> - контекстне меню.</p>
        <p>У бібліотеці Qt меню реалізується класом QMenu. Цей клас визначено в заголовки QMenu. Основне призначення класу - це розміщення команд в меню. Кожна команда представляє об'єкт дії (клас QAction). Всі дії і саме меню можуть бути з'єднані зі слотами для виконання відповідного коду при виборі команди користувачем.</p>
        <p>Наприклад, якщо користувач виділив команду меню, то і меню, і об'єкти дій висилають сигнал hovered (), і якщо вам потрібно зробити в цей момент будь-які дії, то їх потрібно з'єднати з відповідним слотом.</p>
        <h2>Анатомія меню. Класи QMenu і QMenuBar</h2>
        <p>Користувачеві буде легше звикнути до роботи з новою програмою, якщо її меню буде схоже на меню інших програм. На малюнку показані складові типового меню.</p>
        <br><img src="images/menu.png"><br>
        <p>Основний відправною точкою меню є меню верхнього рівня. Воно являє собою меню з постійно видимим набором команд, які, в свою чергу, можуть бути обрані за допомогою покажчика миші або клавіш клавіатури (&lt;Alt> і клавіші курсора). Команди меню верхнього рівня призначені для відображення меню, що випадають, тому їх не слід використовувати для інших цілей, так як це може неабияк спантеличити користувача. Намагайтеся логічно групувати команди і об'єднувати їх в одному випадаючому меню, яке, в свою чергу, буде викликатися при виборі відповідної команди верхнього меню. Клас QMenuBar відповідає за меню верхнього рівня і визначено в заголовки QMenuBar.</p>
        <p>"Гарячі" клавіші інформують користувача про комбінації клавіш, за допомогою якої виконується той же дію, що і при виборі відповідної команди меню. Наприклад, для відображення вікна About Q&lt; (Про Qt), в прикладі, показаному на малюнку, використовується комбінація клавіш &lt;Ctrl> + &lt;Q>. Намагайтеся використовувати стандартні комбінації для "гарячих" клавіш.</p>
        <p>По можливості, для всіх пунктів меню повинні бути визначені клавіші швидкого виклику. Це дозволить користувачеві вибирати команди не тільки за допомогою миші, але і за допомогою клавіатури, натиснувши підкреслену букву (в назві команди) спільно з клавішею &lt;Alt>. Наприклад, для вибору команди Exit (Вихід) потрібно натиснути &lt;Alt> + &lt;E>. Основні відмінності подібного роду комбінацій для швидкого виклику від "гарячих" клавіш полягають у наступному:</p>
        <p> - такі комбінації складаються з буквеної клавіші і клавіші &lt;Alt>;</p>
        <p> - вони зустрічаються не тільки в меню, але і в діалогових вікнах;</p>
        <p> - вони представляють собою контекстне виконання команд. Наприклад, щоб викликати діалогове вікно About Qt (Про Qt) потрібно відкрити меню Menu (Меню) комбінацією &lt;Alt> + &lt;M>, а потім натиснути &lt;Alt> + &lt;A>.</p>
        <p>Стрілка у команди SubMenu (Підменю) говорить про те, що при виборі цієї команди з'явиться вкладене підменю, в нашому випадку - Test (Тест). Вкладене підменю зручно для того, щоб розвантажити меню, якщо воно містить велику кількість команд. Для зручності і розуміння програми рекомендується, щоб ступінь вкладення не перевищувала двох рівнів.</p>
        <p>Роздільник - це риса, яка відокремлює одну групу команд від іншої.</p>
        <p>Команда з прапорцем використовується для надання користувачеві інформації про режим роботи програми та сигналізує про активованої команді меню.</p>
        <p>Піктограма команди відображає команду меню в графічному вигляді. Це дуже хороший прийом для додаткової ілюстрації дій самої команди.</p>
        <p>Іноді зустрічаються команди, які не можна виконати в певний момент часу. У таких випадках застосування повинне робити такі команди недоступними, тобто робити їх вибір неможливим. Недоступні команди меню відображаються іншим, як правило - сірим, кольором.</p>
        <p>Також, пам'ятайте, що в тих випадках, коли команда меню викликає діалогове вікно, її назва повинна містити три точки. Це правило, правда, не поширюється на виклик простих вікон повідомлень.</p>
        <p>У наступному коді Qt реалізується меню, показане на малюнку вище:</p>
       <pre><code class="cpp"> #include < QtGui >   

       #include "img4.xpm"   

       int main(int argc, char** argv)   

       {   

           QApplication app(argc, argv);   

           QMenuBar mnuBar;   

           QMenu* pmnu = new QMenu("&Menu");   

           pmnu->addAction("&About Qt",&app,SLOT(aboutQt()),Qt::CTRL + Qt::Key_Q);   

           pmnu->addSeparator();   

           QAction* pCheckableAction = pmnu->addAction("&CheckableItem");   

           pCheckableAction->setCheckable(true);   

           pCheckableAction->setChecked(true);   

           pmnu->addAction(QPixmap(img4_xpm), "&IconItem");   

           QMenu* pmnuSubMenu = new QMenu("&SubMenu", pmnu);   

           pmnu->addMenu(pmnuSubMenu);   

           pmnuSubMenu->addAction("&Test");   

           QAction* pDisabledAction = pmnu->addAction("&DisabledItem");   

           pDisabledAction->setEnabled(false);   

           pmnu->addSeparator();   

           pmnu->addAction("&Exit", &app, SLOT(quit()));   

           mnuBar.addMenu(pmnu);   

           mnuBar.show();   

           return app.exec();   

       }   </code></pre>
        <p>Щоб створити повноцінне меню, потрібно до кожної команди меню верхнього рівня приєднати відповідне спливаюче меню. За спливаючі меню відповідає клас QMenu. Отже, для створення меню необхідно мати віджет класу QMenuBar - покажчик pmnuBar і, щонайменше, один віджет класу QMenu - покажчик pmnu.</p>
        <p>Для додавання спливаючого меню до меню верхнього рівня потрібно передати в метод addAction () назва команди. Кожен метод addAction () повертає покажчик на об'єкт дії QAction. Користуючись цим покажчиком можна отримати доступ до команди меню (pCheckableAction). Таким чином, виклик з об'єкта дії методу setCheckable () про надає можливість установки прапорця. Подальший виклик методу setChecked () встановлює стан прапорця. У нашому прикладі в цей метод передається значення true, а це значить, що він буде перебувати під "включеному" стані.</p>
        <p>Метод addAction () приймає чотири параметри. Перший задає назву команди меню, в якому можна вказати букву для швидкого виклику, поставивши перед нею символ &. Не упускайте з виду того, що команди меню не повинні містити однакових букв, які використовуються для швидкого виклику, адже, в іншому випадку, одна з команд буде недоступна. Другим параметром передається покажчик на об'єкт, що містить слот, який викликається при виборі цієї команди. Сам слот передається третім параметром. Останній параметр задає комбінацію для "гарячої" клавіші. У нашому прикладі, для відображення діалогового вікна AboutQt (Про Qt) використовується комбінація &lt;Ctrl> + &lt;Q>. Натискання цієї комбінації призведе до того ж дії, що і вибір відповідної команди меню, а саме - буде викликаний слот об'єкта додатка aboutQt ().</p>
        <p>Виклик методу addSeparator () додає роздільник в меню.</p>
        <p>Покажчиком на об'єкт дії (pDisableAction) можна скористатися також і для того, щоб зробити деякі з команд меню недоступними - за допомогою методу setEnabled ().</p>
        <p>В метод addAction() первым параметром можно передавать объекты растровых изображений для установки пиктограммы действия команды.</p>
        <script type="text/javascript">hljs.initHighlightingOnLoad();</script>
       