
        <center><h1>Mодулі Qt</h1></center>
        <br>
        <p>Qt 4 складаєтьсaя з декількох модулів, кожен з яких знаходиться в окремій бібліотеці.</p>
        <p>Модулі для розробки загального програмного забезпечення:</p>
        <p> QtCore - Ядро НЕ-графічних класів, використовуваних іншими модулями</p>
        <p> QtGui - Компоненти графічного призначеного для користувача інтерфейсу (GUI)</p>
        <p> QtNetwork - Класи для програмування мережевих додатків</p>
        <p> QtOpenGL - Класи, що підтримують OpenGL</p>
        <p> QtScript - Класи для роботи з Qt Scripts</p>
        <p> QtScriptTools - Додаткові компоненти Qt Script</p>
        <p> QtSql - Класи для роботи з базами даних, що використовують SQL</p>
        <p> QtSvg - Класи для відображення вмісту SVG-файлів</p>
        <p> QtWebKit - Класи для відображення і редагування вмісту веб-сторінок</p>
        <p> QtXml - Класи для обробки XML</p>
        <p> QtXmlPatterns - Механізм XQuery & XPath для XML і призначених для користувача моделей даних</p>
        <p> Phonon - Класи мультимедійного каркасу</p>
        <p> Qt3Support - Класи сумісності з Qt 3</p>
        <p>Модулі для роботи з інструментами Qt:</p>
        <p> QtDesigner - Класи для розширення Qt Designer</p>
        <p> QtUiTools - Класи для обробки форм Qt Designer в додатку </p>
        <p> QtHelp - Класи для онлайнових підказок</p>
        <p> QtAssistant - Підтримка онлайнових підказок</p>
        <p> QtTest - Класи інструментів для тестування модулів</p>
        <p>Наступні модулі розширення доступні в Qt Commercial Editions для Windows:</p>
        <p> QAxContainer - Розширення, що дозволяє працювати з елементами управління ActiveX</p>
        <p> QAxServer - Розширення для створення ActiveX-серверів</p>
        <p>Наступний модуль розширення доступний у всіх Qt Editions на Unix платформах:</p>
        <p> QtDBus - Підтримка взаємодії між процесами через інтерфейс D-Bus</p>
        <p>Якщо для створення ваших проектів ви використовуєте qmake, то модулі QtCore і QtGui включаються в проект за замовчуванням. Для складання проекту тільки з QtCore, додайте в ваш .pro-файл такий рядок:</p>
        <pre><code class="cpp">QT -= gui</code></pre>
        <p>У Windows, якщо ви не використовуєте qmake, Visual Studio Integration, доступний за комерційним ліцензіями, або інші інструменти для збірки, такі як CMake, вам необхідно також прілінкованние бібліотеку qtmain.</p>
        <script type="text/javascript">hljs.initHighlightingOnLoad();</script>
        