
        <center><h1>Qt Creator</h1></center>
        <br>
        <p>Qt Creator — інтегроване середовище розробки, призначене для створення крос-платформових застосунків з використанням бібліотеки Qt. Підтримується розробка як класичних програм мовою C++, так і використання мови QML, для визначення сценаріїв, в якій використовується JavaScript, а структура і параметри елементів інтерфейсу задаються CSS-подібними блоками. Qt Creator може використовувати GCC або Microsoft VC++ як компілятор і GDB як зневаджувач. Для Windows версій бібліотека комплектується компілятором, заголовними і об'єктними файлами MinGW.</p>
        <h2>Історія</h2>
        <p>Qt Creator розроблена норвезькою компанією Trolltech, яку у 2008 році поглинула Nokia. Анонс проекту відбувся на Qt Developer Days в жовтні 2008 року[2]. Публічна бета-версія проекту була опублікована 30 жовтня 2008[3]. Фінальний реліз відбувся 3 березня 2009 року (разом з виходом Qt 4.5)[4].</p>
        <p>Після укладення стратегічного союзу з Microsoft Nokia втратила інтерес до розвитку технологій Qt. У березні 2011 фінська компанія Digia, постачальник ERP-систем, послуг і рішень в області мобільних систем і користувацьких інтерфейсів, оголосила про укладення угоди з Nokia про викуп у тої прав на комерційне ліцензування та надання послуг з підтримки розробки з використанням бібліотеки Qt.[5] У вересні 2012 Nokia повністю відмовилася від Qt і Digia купує у Nokia весь бізнес і програмні технології, пов'язані з Qt.[6]</p>
        <h2>Особливості</h2>
        <p>1. Зроблений спеціально для розробки на Qt</p>
        <p>2. Вбудований редактор форм (Qt Designer) і довідкова система (Qt Assistant)</p>
        <p>3. онтекстно-залежна система допомоги</p>
        <p>4. Розширюваність плагінами</p>
        <p>5. Є графічний фронтенд для GDB</p>
        <p>6. Підтримка зневадження за допомогою CDB</p>
        <p>7. Для створення проектів використовується qmake (планується підтримка Makefile та тестується підтримка CMake)</p>
        <p>8. Узагальнене підсвічування синтаксису, підтримується велика кількість мов програмування і розмітки. Є можливість створення своїх стилів підсвічування</p>
        <p>9. Можливість редагувати етапи складання проекту</p>
        <p>10. Підтримка розробки на мовах C/C++, JavaScript, QML</p>
        <p>11. QML-дизайнер</p>
        <p>12. Можливість розробки під Symbian і Maemo зі зневадженням в симуляторі або на пристрої</p>
        